In [136]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os
from sklearn.preprocessing import LabelEncoder
import collections

In [137]:
data_folder = '../../data/churn/'

In [138]:
data = pd.read_csv(os.path.join(data_folder, 'train.csv'), delimiter=',')

In [139]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,01/10/2017,0,5200,NaN,810,21OCT17:00:00:00,5023.0,POS,0,0.0
1,01/10/2017,0,6011,NaN,810,12OCT17:12:24:07,20000.0,DEPOSIT,0,0.0
2,01/12/2017,0,5921,NaN,810,05DEC17:00:00:00,767.0,POS,0,0.0
3,01/10/2017,0,5411,NaN,810,21OCT17:00:00:00,2031.0,POS,0,0.0
4,01/10/2017,0,6012,NaN,810,24OCT17:13:14:24,36562.0,C2C_OUT,0,0.0

In [140]:
data['PERIOD'].unique()

array(['01/10/2017', '01/12/2017', '01/07/2017', '01/09/2017',
       '01/08/2017', '01/06/2017', '01/04/2017', '01/05/2017',
       '01/03/2017', '01/11/2016', '01/12/2016', '01/01/2017',
       '01/02/2017', '01/11/2017', '01/01/2018', '01/02/2018',
       '01/03/2018', '01/04/2018', '01/10/2016'], dtype=object)

In [141]:
data['PERIOD'] = data['PERIOD'].apply(lambda x: pd.to_datetime(x, format='%d/%m/%Y'))

In [142]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2017-10-01,0,5200,NaN,810,21OCT17:00:00:00,5023.0,POS,0,0.0
1,2017-10-01,0,6011,NaN,810,12OCT17:12:24:07,20000.0,DEPOSIT,0,0.0
2,2017-12-01,0,5921,NaN,810,05DEC17:00:00:00,767.0,POS,0,0.0
3,2017-10-01,0,5411,NaN,810,21OCT17:00:00:00,2031.0,POS,0,0.0
4,2017-10-01,0,6012,NaN,810,24OCT17:13:14:24,36562.0,C2C_OUT,0,0.0

In [143]:
data.sort_values(by='PERIOD', axis=0, inplace=True)

In [144]:
data.reset_index(inplace=True, drop=True)

In [145]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,7622,5533,type1,810,26OCT16:00:00:00,210.00,POS,0,0.0
1,2016-10-01,9039,8099,type1,810,28OCT16:00:00:00,1350.00,POS,0,0.0
2,2016-10-01,6588,5411,type1,810,23OCT16:00:00:00,514.96,POS,1,691.0
3,2016-10-01,7929,8999,type1,810,21OCT16:00:00:00,13254.78,POS,0,0.0
4,2016-10-01,5195,4111,type1,810,21OCT16:00:00:00,840.00,POS,0,0.0

In [146]:
data['TRDATETIME'].unique()

array(['26OCT16:00:00:00', '28OCT16:00:00:00', '23OCT16:00:00:00', ...,
       '02APR18:08:58:13', '02APR18:19:07:05', '02APR18:17:01:46'],
      dtype=object)

In [147]:
month_lookup = {'JAN': '01', 'FEB': '02', 'MAR': '03', 'APR': '04', 'MAY': '05', 'JUN': '06', 'JUL': '07', 'AUG': '08', 
                'SEP': '09', 'OCT': '10', 'NOV': '11', 'DEC': '12'}

In [148]:
data['TRDATETIME'] = data['TRDATETIME'].apply(lambda x: x[:2] + '.' + month_lookup[x[2:5]] + '.' + x[5:7] + ' ' + x[8:])

In [149]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,7622,5533,type1,810,26.10.16 00:00:00,210.00,POS,0,0.0
1,2016-10-01,9039,8099,type1,810,28.10.16 00:00:00,1350.00,POS,0,0.0
2,2016-10-01,6588,5411,type1,810,23.10.16 00:00:00,514.96,POS,1,691.0
3,2016-10-01,7929,8999,type1,810,21.10.16 00:00:00,13254.78,POS,0,0.0
4,2016-10-01,5195,4111,type1,810,21.10.16 00:00:00,840.00,POS,0,0.0

In [150]:
data['TRDATETIME'] = data['TRDATETIME'].apply(lambda x: pd.to_datetime(x, format='%d.%m.%y %H:%M:%S'))

In [151]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,7622,5533,type1,810,2016-10-26,210.00,POS,0,0.0
1,2016-10-01,9039,8099,type1,810,2016-10-28,1350.00,POS,0,0.0
2,2016-10-01,6588,5411,type1,810,2016-10-23,514.96,POS,1,691.0
3,2016-10-01,7929,8999,type1,810,2016-10-21,13254.78,POS,0,0.0
4,2016-10-01,5195,4111,type1,810,2016-10-21,840.00,POS,0,0.0

In [152]:
data.sort_values(by='TRDATETIME', axis=0, inplace=True)

In [153]:
data.reset_index(inplace=True, drop=True)

In [154]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,485,4121,type2,810,2016-10-07 00:00:00,242.0,POS,1,85.00
1,2016-10-01,1290,5411,type2,810,2016-10-07 00:00:00,2465.0,POS,1,321242.09
2,2016-10-01,485,6011,type2,810,2016-10-07 00:00:00,3600.0,WD_ATM_PARTNER,1,85.00
3,2016-10-01,1290,6011,type2,810,2016-10-07 18:57:17,10000.0,WD_ATM_ROS,1,321242.09
4,2016-10-01,5948,5511,type1,810,2016-10-08 00:00:00,780.0,POS,1,4222.62

In [155]:
enc = LabelEncoder()
data['MCC'] = enc.fit_transform(data['MCC'])

In [156]:
collections.Counter(data['MCC'].values)

Counter({103: 6266,
         158: 121640,
         244: 54382,
         164: 485,
         168: 19816,
         176: 410,
         126: 72,
         217: 212,
         337: 2599,
         245: 10056,
         119: 6205,
         163: 27237,
         268: 780,
         198: 41351,
         234: 1563,
         190: 2667,
         242: 13073,
         238: 1588,
         148: 6262,
         180: 2601,
         196: 30027,
         182: 5161,
         197: 1844,
         204: 8578,
         152: 899,
         232: 4300,
         209: 2597,
         102: 1854,
         203: 18728,
         151: 4803,
         312: 1420,
         177: 2710,
         322: 2674,
         236: 235,
         19: 9,
         101: 4362,
         185: 2415,
         111: 1647,
         147: 3460,
         318: 472,
         261: 1862,
         166: 158,
         194: 990,
         156: 7641,
         179: 564,
         114: 898,
         289: 600,
         215: 762,
         298: 1987,
         153: 559,
         270: 899,
         301: 704,
         213: 2461,
         178: 2915,
         211: 781,
         286: 821,
         191: 3271,
         290: 674,
         235: 1729,
         339: 203,
         117: 2416,
         113: 781,
         246: 643,
         157: 1038,
         258: 130,
         341: 759,
         269: 438,
         121: 1473,
         184: 1741,
         167: 2946,
         210: 1420,
         16: 625,
         116: 2857,
         181: 98,
         314: 477,
         155: 3258,
         10: 4,
         342: 71,
         315: 438,
         222: 1841,
         214: 104,
         54: 18,
         132: 74,
         325: 35,
         115: 575,
         175: 1045,
         144: 78,
         292: 14,
         189: 786,
         260: 128,
         311: 189,
         83: 45,
         283: 429,
         252: 2430,
         118: 859,
         133: 23,
         216: 304,
         149: 64,
         160: 376,
         248: 523,
         186: 71,
         173: 18,
         212: 831,
         52: 38,
         193: 160,
         316: 649,
         276: 53,
         329: 18,
         31: 4,
         159: 211,
         109: 29,
         201: 24,
         309: 181,
         304: 88,
         150: 408,
         330: 91,
         284: 187,
         162: 379,
         122: 32,
         206: 4,
         321: 135,
         305: 236,
         266: 43,
         169: 492,
         106: 307,
         120: 116,
         125: 34,
         237: 214,
         306: 334,
         273: 54,
         310: 339,
         313: 26,
         200: 444,
         187: 260,
         142: 24,
         124: 165,
         0: 63,
         174: 442,
         135: 11,
         263: 25,
         105: 139,
         250: 17,
         336: 5,
         104: 149,
         129: 4,
         195: 258,
         55: 12,
         134: 15,
         130: 31,
         319: 5,
         227: 38,
         226: 30,
         137: 53,
         328: 124,
         4: 30,
         294: 25,
         218: 74,
         11: 10,
         154: 43,
         127: 21,
         128: 21,
         42: 15,
         68: 29,
         256: 43,
         5: 5,
         143: 110,
         323: 21,
         331: 32,
         96: 1,
         139: 21,
         280: 19,
         17: 12,
         183: 31,
         138: 31,
         271: 5,
         296: 51,
         302: 22,
         297: 5,
         73: 15,
         249: 11,
         205: 38,
         82: 15,
         320: 98,
         231: 58,
         18: 6,
         14: 18,
         28: 15,
         228: 35,
         136: 27,
         247: 109,
         281: 6,
         108: 40,
         223: 3,
         13: 6,
         41: 7,
         44: 9,
         338: 19,
         112: 18,
         282: 57,
         192: 40,
         57: 27,
         161: 158,
         324: 23,
         8: 7,
         279: 32,
         326: 3,
         303: 8,
         327: 3,
         299: 33,
         287: 19,
         141: 13,
         46: 15,
         221: 7,
         243: 123,
         25: 17,
         230: 12,
         267: 13,
         340: 173,
         254: 24,
         219: 1,
         225: 23,
         107: 14,
         39: 3,
         90: 7,
         3: 14,
         6: 11,
         100: 27,
         36: 4,
         334: 6,
         89: 1,
         123: 11,
         47: 7,
         265: 3,
         171: 8,
         131: 7,
         199: 3,
         32: 2,
         208: 28,
         277: 36,
         15: 22,
         86: 1,
         165: 125,
         67: 1,
         300: 5,
         45: 4,
         332: 9,
         146: 15,
         85: 3,
         188: 6,
         97: 7,
         63: 20,
         224: 27,
         262: 10,
         278: 7,
         272: 1,
         241: 1,
         87: 4,
         251: 61,
         62: 9,
         95: 1,
         59: 1,
         7: 9,
         33: 5,
         58: 3,
         51: 2,
         50: 2,
         343: 4,
         140: 3,
         24: 3,
         240: 2,
         288: 3,
         275: 31,
         75: 16,
         255: 14,
         239: 3,
         333: 1,
         22: 7,
         1: 13,
         65: 2,
         71: 14,
         220: 2,
         69: 2,
         291: 2,
         93: 3,
         307: 3,
         172: 7,
         2: 5,
         317: 6,
         233: 2,
         257: 1,
         308: 2,
         49: 2,
         229: 15,
         110: 6,
         84: 2,
         43: 4,
         76: 1,
         34: 8,
         53: 2,
         99: 2,
         94: 1,
         274: 1,
         74: 4,
         60: 1,
         30: 9,
         91: 3,
         98: 1,
         77: 2,
         79: 1,
         48: 1,
         20: 2,
         56: 1,
         259: 1,
         38: 2,
         145: 14,
         26: 1,
         27: 1,
         70: 2,
         78: 1,
         207: 1,
         61: 1,
         170: 2,
         264: 2,
         12: 4,
         9: 3,
         72: 1,
         40: 2,
         335: 6,
         202: 2,
         285: 1,
         88: 1,
         80: 1,
         92: 1,
         23: 3,
         253: 1,
         21: 1,
         37: 1,
         35: 1,
         295: 1,
         66: 4,
         293: 2,
         29: 1,
         81: 1,
         64: 1})

In [111]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,485,103,type2,810,2016-10-07 00:00:00,242.0,POS,1,85.00
1,2016-10-01,1290,158,type2,810,2016-10-07 00:00:00,2465.0,POS,1,321242.09
2,2016-10-01,485,244,type2,810,2016-10-07 00:00:00,3600.0,WD_ATM_PARTNER,1,85.00
3,2016-10-01,1290,244,type2,810,2016-10-07 18:57:17,10000.0,WD_ATM_ROS,1,321242.09
4,2016-10-01,5948,164,type1,810,2016-10-08 00:00:00,780.0,POS,1,4222.62

In [112]:
df = data.groupby('cl_id')['MCC'].agg(lambda x: list(x))

In [113]:
df = pd.DataFrame(df)
df.reset_index(inplace=True)

In [114]:
df.head()

   cl_id                                                MCC
0      0                          [244, 147, 158, 245, 204]
1      1  [198, 158, 198, 198, 158, 244, 158, 198, 198, ...
2      5  [178, 197, 178, 182, 113, 158, 301, 158, 182, ...
3      9  [242, 244, 245, 242, 244, 245, 242, 242, 242, ...
4     10  [158, 168, 158, 163, 158, 244, 244, 242, 242, ...

In [115]:
target_df = data[['cl_id', 'target_flag']].drop_duplicates()
target_df.reset_index(inplace=True, drop=True)

In [116]:
df = df.merge(target_df, how='inner',on='cl_id')

In [117]:
df.head()

   cl_id                                                MCC  target_flag
0      0                          [244, 147, 158, 245, 204]            0
1      1  [198, 158, 198, 198, 158, 244, 158, 198, 198, ...            0
2      5  [178, 197, 178, 182, 113, 158, 301, 158, 182, ...            1
3      9  [242, 244, 245, 242, 244, 245, 242, 242, 242, ...            0
4     10  [158, 168, 158, 163, 158, 244, 244, 242, 242, ...            0

In [118]:
df.rename({'cl_id': 'id', 'MCC': 'mcc', 'target_flag': 'target'}, axis=1, inplace=True)

In [119]:
df.head()

   id                                                mcc  target
0   0                          [244, 147, 158, 245, 204]       0
1   1  [198, 158, 198, 198, 158, 244, 158, 198, 198, ...       0
2   5  [178, 197, 178, 182, 113, 158, 301, 158, 182, ...       1
3   9  [242, 244, 245, 242, 244, 245, 242, 242, 242, ...       0
4  10  [158, 168, 158, 163, 158, 244, 244, 242, 242, ...       0

In [120]:
df.shape

(5000, 3)

In [121]:
all_l = []
for i in range(len(df)):
    all_l.append(len(df.loc[i, 'mcc']))

In [122]:
df = df.loc[df['mcc'].apply(lambda x: len(x)) >= 10]

In [123]:
df.shape

(4617, 3)

In [124]:
df['mcc'] = df['mcc'].apply(lambda x: x[-200:])

In [125]:
df['target'].value_counts()

1    2672
0    1945
Name: target, dtype: int64

In [126]:
zero_id = df.loc[df['target']==0]['id']
one_id = df.loc[df['target']==1]['id']

reduced_one_id = np.random.choice(one_id, size=len(df.loc[df['target']==0]), replace=False)
df = df.loc[df['id'].isin(list(zero_id)+list(reduced_one_id))]
df.reset_index(inplace=True, drop=True)
df['target'].sum() / len(df) * 100

50.0

In [127]:
df = df.sample(frac=1).reset_index(drop=True)

In [128]:
df.shape

(3890, 3)

### Train-valid-test split

In [129]:
all_id = df['id'].values

In [130]:
train_id = all_id[:int(0.7 * len(all_id))]
valid_id = all_id[int(0.7 * len(all_id)):int(0.8 * len(all_id))]
test_id = all_id[int(0.8 * len(all_id)):]

In [131]:
train_df = df.loc[df['id'].isin(train_id)]
valid_df = df.loc[df['id'].isin(valid_id)]
test_df = df.loc[df['id'].isin(test_id)]

In [135]:
train_df['target'].sum() / len(train_df), valid_df['target'].sum() / len(valid_df), \
test_df['target'].sum() / len(test_df)

(0.5031215571061329, 0.4987146529562982, 0.4897172236503856)

In [132]:
len(train_id) / len(df), len(valid_id) / len(df), len(test_id) / len(df)

(0.7, 0.1, 0.2)

In [133]:
train_df.reset_index(inplace=True, drop=True)
valid_df.reset_index(inplace=True, drop=True)
test_df.reset_index(inplace=True, drop=True)

In [134]:
train_df.to_csv('../../data/processed_churn/train.csv')
valid_df.to_csv('../../data/processed_churn/valid.csv')
test_df.to_csv('../../data/processed_churn/test.csv')